{"data":[{"title":"为什么说钱包当下需要Omni版USDT","createTime":"2018/08/05 21:12","time":302,"content":["最近业内有人感慨道：钱包大战一触即发","这种说法的观点是：现在很多创业者已经冲进了钱包这个领域，钱包开发团队也如雨后春笋般涌了出来，市场俨然一片红海。","首先，这种观点显然是立不住脚的，因为从长远来看，钱包真正竞争的地方在于实现了跨链技术的去中心化交易所以及是否可以承载基于不同主链运行的Dapp。","不过仅从当下来看，","谁先支持了Omni版本的USDT谁就获得了一定的竞争优势。","不可否认，币圈现在关于数字资产用途的最大共识就是炒币。而对炒币至关重要的是稳定代币，Omni版本的USDT作为发行量最大，流通性最广的稳定代币，在当下的交易场景里一直承担着风险对冲及资产保值的重要角色。",{"img":"https://img.jinse.com/1013842_watermarknone.png"},"可以说，没有USDT就不会有数字货币当下的繁荣。","现在，业内多数钱包都在布局去中心化交易所，例如基于以太坊，用以实现ERC20代币间币币交易的kyber协议，或者Bancor协议。","但是，目前的去中心化交易所在实际运用中，无论是交易速度还是使用习惯，都不能满足大部分人的需求。","并且，当前的去中心化交易方案也没有实现跨链间的原子交易，我们离真正意义上的去中心化交易所实际还有很长的路要走。",{"img":"https://img.jinse.com/1018922_watermarknone.png"},"所以，相比提供没有实现跨链交易的去中心化交易所服务，钱包能够在现有交易场景上做提升与改变也是很值得肯定的。这其中，钱包能够支持Omni版本的USDT，并且提供基于USDT的交易对、OTC以及理财业务将会成为真正的刚需。其具体表现为以下三个方面： ","01","为交易员手中巨量的USDT提供安全可靠的存储方案","通过OTC交易获得USDT，从而获取进入数字资产世界的准入资格是一切交易的开始。但是，提供OTC服务的场外交易员却一直面临一个巨大的风险：因为长期缺乏一个安全靠谱的钱包，而不得不把币托管在交易所账户，令巨额的资产一直处于高风险之中。因此，市场上一直存在对可以安全可靠存储USDT的钱包的需求。 ","02","为交易者提供风险对冲及风险规避方案","稳定代币首先可以让各种币的价格可以直观展现出来，让数字资产持有者可以对自己的资金情况有清晰明确的掌握。其次，因为数字资产有着高风险，波动剧烈的特性，适时兑换成稳定代币是数字资产持有者进行风险对冲及风险规避的重要手段。如果只有币币兑换而没有基于稳定代币的交易对，那这样的交易所恐怕很难被市场广泛接受。","03","为量化交易、搬砖套利提供便捷服务","交易所很大一部分交易量来自量化团队及搬砖用户，无论是量化交易还是搬砖套利，都需要将收益转换成稳定代币来进行保值或者变现。量化及搬砖必然需要在各平台进行一定量的数字资产及稳定代币的存储。如果钱包没有USDT，就无法为量化及搬砖套利的用户提供便利。那么必然会导致交易深度受到极大影响，整个交易生态自然很难起的来。","所以，不难看出，在现阶段钱包之间的竞争实际上还是交易层面的竞争，谁能够为主流稳定代币USDT提供安全的存储方案，并且提供像中心化交易所一样快速的交易服务，谁就可以获得用户用脚投出的票。 ","作为唯一一款从行业之初就在安全的守护用户资产，且从未离开，从未发生过一起技术性丢币事件的去中心化钱包，比特派早在2月份就提出了“中心化撮合，去中心化交割”的交易理念。现在也很高兴可以向大家宣布，我们将在本周上线Omni版本的USDT，并在接下里的一两周时间内，逐步开放基于USDT的交易对，OTC交易以及理财产品。","我们希望我们的努力为有需求的人提供了真正有效的支持，同时希望我们可以让用户在钱包安全的基础上，享受不亚于中心化交易所的服务。","最后再说一句：钱包要走的路还很长，当前的阶段也希望大家更多的关注如何为用户提供良好服务而非一时的竞争。"],"id":1},{"title":"欢哥科普比特币钱包是什么有哪些分类？","createTime":"2018/08/04 11:45","time":316,"content":["比特币钱包（数字钱包）是保存和加密“秘钥”（类似银行卡密码）的工具。在上面的文章中欢哥（jingshui902）讲过，比特币钱包就相当于你的实物钱包，地址就相当于你钱包里的银行卡，私钥就是你的银行卡密码。","比特币钱包有很多种类，大致可以分为在线钱包和离线钱包两大类。","所谓在线钱包，就是联着网生成私钥或者连着网运行的钱包，通常我们也叫它热钱包。热钱包优点是使用方便，新手易操作，交易转账的效率比较高；缺点则是安全性不如冷钱包好。","离线钱包，就是不联网的钱包，我们也叫它冷钱包。冷钱包因为不联网，所以大大降低了黑客能够盗取的概率，相对来说比较安全，但是冷钱包的操作比较复杂，创建起来不方便，适合有技术背景的人去使用。","除了热钱包和冷钱包外，其实钱包还有另外一种分类的维度。",{"img":"https://img.jinse.com/1016566_image3.png"},"全节点钱包","第一类是全节点钱包。全节点钱包也是早期的钱包形态，它意思是它会从网上下载比特币网络所有的节点，从它的第一个区块至今所有的数据。这个钱包自身会维护全网的数据，自己来验证竞争挖矿的结果，是完全的去中心化的钱包。典型的例子是Bitcoin Core，官方核心钱包。","全节点钱包是历史最早的钱包，优点是隐私性很好，能更快验证交易信息；缺点是会占用很多硬盘空间，每次使用前需要同步数据，使用起来很不方便，并且不支持多种数字资产。","轻钱包","第二类钱包，叫做轻钱包。这类钱包只维护跟你有关的交易相关数据，不同步其他数据，也属于去中心化的钱包的一种。类似于imToken钱包就是轻钱包，可以运行在电脑，手机，网页等地方。","轻钱包的优点是体积小、不占空间，用户体验很好，尤其对于新手，并且很多轻钱包都支持多种数字资产；缺点是交易验证会稍微慢一点。","中心化钱包","第三类就是中心化钱包。它完全依赖于运行这个钱包的公司还有服务器，你读取的数据可能都来自于这家公司提供给你的，而不是比特币网络数据提供给你的数据。选择这一类钱包的时候一定要注意它的历史口碑，因为它是中心化钱包。","中心化钱包的优点是私钥忘记了可以找回，平台会把私钥安全做的不错；缺点是私钥控制在平台手上，平台“做坏事”你是无法阻止的，平台关闭后你的币就没有了。","大家可能还听说过另外一个名词，叫做硬件钱包。硬件钱包是什么？在2017年9月份，受国内市场情绪影响，库神硬件钱包被卖脱销了，在圈内带火了“硬件钱包”这个概念。硬件钱包是指钱包软件运行在专门设计的硬件的技术之上。硬件钱包因为有制造成本，所以不像在线钱包一样免费 ，你需要花钱购买这个硬件设备。这个硬件设备，它的形态是多样的，有的像U盘，有的像手机。当然，持有这种硬件钱包的人，会有一种亲手掌握着比特币的安全感，这也是一些人所追求的。","随着技术的发展，现在一个钱包也可以支持多个币种了。如果你有两种以上数字资产，可以选择支持多币种的钱包，这样管理起来也会更方便。现在主流的钱包一般会支持比特币、以太坊，莱特币、比特现金、以太经典等等。","你可能会问，我是小白，下载一个完全去中心化的钱包，我不会使用，我又担心木马中毒。但是我又不信任由一个中心化公司运行的网页钱包，怕他们被黑客攻击或者监守自盗，那么该怎么办呢？","随着技术的发展，一种叫 “多重签名”的技术在钱包领域得到非常广泛的运用。什么叫“多重签名”呢？我们知道一把私钥对应一个比特币地址，你有了这把私钥才能对比特币上地址上的比特币进行处理。运用私钥进行加密的过程就是签名。那么多重签名的意思，就是需要好几把私钥签名，才能够动用一个地址上的比特币。也就是说，一笔交易，需要有两把到三把，或者更多的私钥签名，才能够完全被移走。这样大大提高了资产的安全性，同时也适用于企业级的比特币转移，同时又不影响它速度。","当然，对于新手来说，轻钱包是最合适不过的了。但是一定要注意安全问题，务必保存好私钥和助记词。","但如果你是大户人家，买了几十个上百个比特币，建议选择使用冷钱包，这样是最安全的。"],"id":2},{"title":"未来去中心化的钱包交易所会干掉中心化交易所吗？","createTime":"2018/08/03 23:03","time":301,"content":["目前我所观察的多个去中心化的钱包交易所都是基于EOS主链的，可能因为EOS是半中心化的结构吧，今后的潜在峰值交易速度较快吧。","其实，交易所这种产品形态是很吃性能的，体验也很不好做，就目前的主链效率水平，还真无法替代掉当今的中心化交易所。而目前众多的开发商都在聚焦EOS主链进行钱包和交易功能的研发，可能更多的还是看上了EOS性能和生态入口这块，想尽早的提前进行布局。","而且这种去中心化的钱包交易所，除了普通的去中心化的币币交易，还应该与高速主链相结合，争取也实现去中心化的数字资产出租、借贷、杠杆等常用功能。这样才会有实质的产品竞争力，不然想革中心化交易所的命，那是基本上不可能的。","所以，去中心化钱包交易所的交易要达到和中心化交易所一样的性能级别还有很长的路要走。环视当下，我觉得目前的众多高性能主链中，能够承载如此高性能的可能还只有EOS。",{"img":"https://img.jinse.com/1013807_image3.png"},"中心化交易所带给我们的痛点，未来的钱包交易所该是什么样的","中心化交易所带给我们的痛点主要体现在下面几个方面。","第一，安全性差","由于当前主流中心化的数字资产交易平台的资产控制权在交易平台，一旦交易平台遭遇黑客攻击、服务器问题等，用户的数字资产将有可能会损失。目前已经发生的其中比较严重的安全事件有：","2014年Mt . Gox事件，造成了超过 85 万比特币失窃。","2017年Parity钱包被黑客攻击，导致至少有 15 万个以太坊被盗取。","2017年，超过3100万美元的泰达币(tether)被盗取。","2018年Coincheck被黑客窃取价值 5 亿美元的加密货币。","我觉得，今后的钱包交易所不管是什么形态的，安全一定是第一位的。安全，其实就是一种信任，一种背书。安全对于钱包形态的交易所是至关重要的，某些情况下还可能是致命的。","未来的钱包交易所，无论你的机制做的多么完美，激励做的多么出色，你若是没有一只出色的安全团队，那你开交易所就是找死、找骂、找官司！","第二，存在中心化黑幕，不能自证清白","目前的大部分主流数字资产交易平台都是中心化的交易平台。这种中心化的模式比较高效，但因为数字资产被交易平台控制，极易出现暗箱操作、挪用用户的数字资产等问题。","今后的钱包交易所，我想形态上一定是去中心化的。中心化产生黑幕和不公，这是大家都知道的。目前中心化交易所的账大家是没法查的，要是交易所被黑客黑了，出现了亏空，大家是不可能知道真实情况的。而基于链上交易的去中心化钱包交易所，所有的规范和约束条款，都是由智能合约控制，没有第三方可以进行操纵。","所以，未来的钱包交易所一定是透明的和去中心化的。任何的交易和账本都应该在链上，应该完全的对公众和社区透明。这种完全透明的机制可以赢取最大的公众信任和强背书。","第三，交易费用高昂","目前的中心化交易所，交易费用还是比较贵的，只是由于使用的是中心化服务器，因此拥有极高的性能和交易深度，体验度较好。","而未来的去中心化钱包交易所，由于交易都是运行在链上的。因此基于EOS的钱包交易所我觉得费用应该可以降的很低。","第四，上币费用高昂","这个已经是广为诟病的痛点了，现在的项目方要到大的中心化交易所上个币，没有个几百万的上币费是很难搞定的。而基于链上交易的去中心化钱包交易所，由于是基于公链智能合约的，如果代币能够进行广泛的公投，我想是会被很多去中心化交易所主动上币吸引交易流量的。",{"img":"https://img.jinse.com/1013808_image3.png"},"未来去中心化的钱包交易所会干掉中心化交易所吗？","关于去中心化的钱包交易所未来能否干掉中心化交易所这回事，贝壳手表CCT觉得应该这样来分析。","首先从历史来看。其实，去中心化交易所很早就有了，最早的去中心化交易所就是比特股嘛。但为啥没有成为主流呢？大概是因为比特股的交易性能和交易功能和体验与目前主流的去中心化交易平台还是相差太远导致，客户体验太差而无法流行开来。","要知道比特股的性能也未必比EOS性能弱啊。我个人乐观估计，去中心化的钱包交易所要想真正的流行来开，现在EOS刚刚不到4000的Tps肯定是不行的。没有个50000以上的Tps，要想把交易做好想都不要想。","当然，如果遥远的今后，去中心化交易平台，能够实现和去中心化交易平台几乎一样的交易性能，还能提供和其一样的交易功能，则将大大提升去中心化交易平台的吸引力，也许那天就真的可以革中心化交易所的命了。"],"id":3},{"title":"超级链技术平台超级钱包生态应用丰富的钱包生态主义","createTime":"2018/08/03 21:55","time":301,"content":["F-coin超级链技术平台是以区块链技术为基础创新发展而来的技术平台,F-coin超级链技术平台采用数字资产的度量标准。超级链(F-coin)为各类程序员和消费者,提供一个标准化、智能化、互通性、兼容性、高效性的且价格非常低廉甚至完全免费的低熵值的表达形式,并提供与这些应用相关的计算机语言开发环境和 API 接口采用多链并行机制,F-coin超级链技术平台采用多链并行机制,跨链共识区 CCD 以及F-coin 和跨链共识节点 CCN等。",{"img":"http://img.meijiehezi.com/upload/doc/20180803/5b63c886130aa.png"},"F-coin超级链技术平台在主链部分节点与侧链部分节点组成跨链共识区,跨链共识域内节点对跨链交易达成共识,然后分享跨链数据到其他对等节点。F-coin超级链技术平台加入跨链共识区的节点需额外加载跨链共识所需的模块,如网络模块、跨链协议处理器模块等。",{"img":"http://img.meijiehezi.com/upload/doc/20180803/5b63c88634cc8.png"},"F-coin超级链技术平台建立了超级链(F-coin)共识机制,从而有效地保证金权益赏POCM 共识机制、浮动保证金机制、动态计算机制、从而获得平衡共识节点收益。F-coin超级链技术平台在整个操作环节进入退出,全网校验,不仅仅进行信用验证,还要求利用共识准入制度。从而完善信用保证系统,规范经济制裁机制、以及容错监控与处罚机制。在整个操作环节进行全网全节点监督,并实现自身调节、维护稳定的作用。",{"img":"http://img.meijiehezi.com/upload/doc/20180803/5b63c88647e58.png"},"F-coin超级链技术平台采用模块化架构,在F-coin超级链技术平台,对于所有超级链(F-coin)的模块都遵循超级链(F-coin)MODEL模块定义。超级链(F-coin)模块管理器负责管理所有模块,定义了模块加载/卸载、服务注册等规范,凡是遵循超级链(F-coin)MODEL 规范的扩展模块都可以通过模块管理器加载到超级链(F-coin)节点运行。",{"img":"http://img.meijiehezi.com/upload/doc/20180803/5b63c886626c4.png"},"F-coin超级链技术平台实行匿实名双功能钱包,对于个人隐私处于高度机密和安全状态,可以与所有匿名用户,进行一切互动。并且在使用的过程中用户需要进行实名认证,方可以与实名认证的用户,进行交易或转帐互动等。F-coin超级链技术平台。超级链(F-coin)超级钱包生态应用系统是一款数字货币的超级钱包,支持超过上千种的数字资产,并且为用户提供数字资产的安全储存及便捷管理功能;同时钱包上线交易所实现一切法币、币币一键转换;并在此基础上建立成一个数字资产的金融应用生态,实现真正的超级钱包超级应用的功能。",{"img":"http://img.meijiehezi.com/upload/doc/20180803/5b63c88683354.png"},"F-coin超级链技术平台超级钱包生态应用系统,采用3DVR实景商城,并且还有数字货币红包,不仅仅可以微信社交聊天,而且对于钱包余额宝挖矿增值,法币数字货币一键转换。此外,在金融支付模块内包含交通、游戏、直播、酒店、资讯、旅游、生活消费、保险等多个行业,F-coin超级链技术平台超级钱包生态应用,极大的丰富了钱包生态应用。"],"id":4},{"title":"黑客窃取加密货币的6种手段：教你如何捂紧你的钱包","createTime":"2018/08/04 10:31","time":301,"content":["据报道，Bleeping Computer在7月初检测到涉嫌窃取230万个比特币钱包的可疑活动，攻击者利用一种叫Clipboard Hijacking的恶意软件窃取比特币，这种软件在剪切板中操作，可以用其中一个攻击者的钱包地址来替换复制的钱包地址。","早在去年11月，卡巴斯基实验室就预测到会出现此类攻击，不久便成了现实。目前，这类攻击被广泛应用在窃取用户信息或资金方面，占此类恶意软件的20%。Cointelegraph在7月12日报道过卡巴斯基实验室报告，报告提到，过去一年犯罪分子可能通过社会工程方案窃取了价值超过900万美元的ETH。",{"img":"https://img.jinse.com/1015949_image3.png"},"上面我们提到的Bleeping Computer是一家致力于提高公众计算机素养的门户网站，该公司提到，为了确保足够的安全性，我们至少应该遵守一些基本的规则：“大多数技术支持问题不在于计算机，而在于用户不知道计算机运作的基本概念。这些概念包括硬件、文件和文件夹、操作系统、互联网和应用程序。”","很多加密货币专家对此也有相同的看法。其中，Ouriel Ohayon（一位投资者和企业家）认为主要原因还是在于用户个人：“你的确掌控着自己的资产，但前提是你得保证资产的安全性。大部分人并不是什么安全专家，往往很容易无形中暴露自己的资产。不过对于很多人甚至还包括那些技术宅们从来不采取基本的安全措施我表示很不能理解。”","Autonomous Research的金融科技战略总监Lex Sokolin提到：“每年都会有很多人成为克隆网站和网络钓鱼的受害者，乖乖地把价值2亿美元的加密货币送到了骗子手中，再也拿不回来。”","这说明了什么？说明黑客们往往会利用系统中的最大的漏洞对钱包实行攻击，这个漏洞正是大家的疏忽和自负心理。我们来看一下他们是如何窃取资金以及我们该如何保护好自己的资金。","美国公司Foley & Lardner的一份调查显示，71%的数字货币交易大户及投资大户认为加密货币窃取事件会对加密货币市场产生很大的影响，31%的受访者则认为会对全球加密货币产业产生很大影响。",{"img":"https://img.jinse.com/1015950_image3.png"},"图片来源：Foley & Lardner","Hackernoon的专家分析了2017年的黑客攻击数据，大致可被归位3类：","- 针对区块链、数字货币交易所以及ICO的攻击；","- 隐藏性挖矿软件的分布；","- 针对用户钱包的攻击。","出人意料的是，这篇分析文的普及度并不是很高。据RT数据，到2024年加密货币持有人数将达到2亿，这就意味着那些老生常谈的忠告需要反复被拿来提醒币友们。","荷兰国际集团（ING Bank NV）和益普索（Ipsos）的调查显示（该调查不包括东亚地区），约有9%的欧洲公民以及8%的美国公民持有加密货币，同时，有25%的公民表示在不久的将来有买进数字资产的打算。这样一来，大约有2.5亿潜在受害者会很快遭遇黑客攻击。","谷歌和苹果应用商店的App","提示：","- 不要安装那些不怎么用得到的移动端app；","- 为智能手机上所有的app添加双因素认证；","- 务必检查项目官网上的app链接。","由于安卓系统没有采用双因素认证（2FA），遭到黑客攻击的受害者中大多数是安卓手机用户。双因素认证不仅需要用户名和密码，还需要其他的一些用户信息，比如一条只有用户知道的信息，或是用户手头即时产生的信息，常见的例子就是物理令牌。据Forbes，谷歌安卓系统的开放性导致其对病毒也更加开放，正因如此，安卓手机的安全性会弱于苹果手机。黑客们会将代表某些加密货币资源的app添加到谷歌应用商店。这些app一旦被启动，用户的登录信息就会被黑客窃取。","这类黑客攻击中，最出名的目标当属美国加密货币交易所Poloniex的交易人员，他们下载了黑客在谷歌应用商店里的app（伪装成目前流行的加密货币交易所移动网关）。Poloniex团队并没有开发安卓版app，官网上也没有任何跳转到移动app的链接。ESET的恶意软件分析师Lukas Stefanko称，截止这个恶意软件从谷歌应用商店下架，有5500名交易人员受其影响。","反过来说，IOS用户更有可能下载携带隐藏矿工的app。为了暂停此类软件的传播势头，苹果公司甚至被迫提高应用商店的app门槛。不过这个话题应另当别论，毕竟它所造成的损失和黑客攻击电子钱包所造成的损失根本不能相提并论，因为挖矿软件只会拖慢电脑运行速度。","Slack机器人","提示：","- 通过发送Slack机器人报告将其加入黑名单；","- 不要参加Slack机器人发起的活动；","- 保护Slack频道。举个例子，用户可以通过Metacert或Webroot安全机器人、Avira防病毒软件，或者内置的谷歌安全浏览功能来进行保护。","自2017年年中以来，用于窃取加密货币的Slack机器人已经成了企业通讯工具的天敌。更常见的情况是黑客们会创建一个机器人告知用户其持有的加密货币有问题。这样做的目的是让用户点击链接并输入私钥。尽管社区通常会在第一时间作出反应，黑客们也不得不暂时撤退，不过后者总是会设法去赚钱。",{"img":"https://img.jinse.com/999407_image3.png"},"图片来源：Steemit @sassal","Enigma集团遭受的黑客攻击被认为是黑客通过Slack机器人进行的最大规模、最成功的攻击。在Enigma举办预售活动时，攻击者使用了Enigma的名字推出了Slack机器人，最终从那些“老实人”手中骗取了价值50万美元的以太坊。","用于加密货币交易的插件","提示：","- 涉及加密货币的操作在一个独立的浏览器中进行","- 开启浏览器无痕模式","- 不要下载任何用于加密货币交易的插件","- 用一台独立的电脑或智能手机进行加密货币交易","- 安装杀毒软件和网络保护软件","为了提高交易和钱包的体验感，网络浏览器会提供一些扩展程序来定制个性化用户界面。这样问题就来了：这些扩展程序是基于JavaScript开发的，当用户使用网络时，即使插件不能读取到用户所输入的内容，用户还是很容易遭受攻击。究其原因，近几年随着Web 2.0、Ajax和丰富的互联网应用的普及，JavaScript和其附带的漏洞在组织中变得非常普遍，尤其是印度组织。此外，很多扩展程序可能被用来偷偷“挖矿”。","短信验证","提示：","- 关闭呼叫转移以防攻击者查看你的数据；","- 不要再通过短信进行双重认证，选个靠谱的软件来进行。","用户习惯以及智能手机的便携性让很多用户选择用手机来进行验证。Positive Technologies（一家致力于维护网络安全的公司）演示了通过七号信令系统（SS7）在近全球范围内拦截一条短信验证码是一件多么简单的事。专家们能够使用他们自己的研究工具劫持短信，这些工具会利用蜂窝网络中的弱点拦截传输中的短信。另外，这家公司还拿Coinbase账户做了演示，让交易所用户深感震惊。Positive Technologies表示：乍看之下，问题在于Coinbase出现漏洞，但是真正的漏洞存在于蜂窝系统本身。这就证明即便用了双重认证，短信验证码还是可以被拦截。","公共Wi-Fi","提示：","- 即便用了VPN也不要通过公共Wi-Fi进行数字货币交易；","- 定期更新路由器固件，因为硬件制造商在不断发布防止密钥替换的路由器","早在去年10月，在使用路由器的Wi-Fi保护协议（WPA）中就发现了一个不可恢复的漏洞。在执行基本的KRACK攻击（重新安装密钥后的攻击）后，用户的设备会重新连接到黑客的Wi-Fi网络。用户通过此网络进行下载或发送的所有信息对攻击者来说都是可用的，当然也包括加密货币钱包的密钥。对于火车站、机场、酒店和人流量较多的区域的公共Wi-Fi网络来说，解决这个问题尤为迫切。","网站克隆和网络钓鱼","提示：","- 不要访问没有https协议的数字加密货币相关网站；","- 在使用Chrome浏览器时，安装一些自定义的扩展程序（比如Cryptonite这种用于显示子菜单地址的插件）；","- 当收到来自数字加密货币相关资源的消息时，将链接复制到浏览器地址栏，并将其与原始站点的地址进行比较；","- 如果有些信息看起来有点可疑，关闭这个窗口，把这封邮件从收件箱中删除。","自“网络革命”以来，人们就已经知道了这些古老的黑客攻击方法，时隔这么久好像这类方法还没“退休”。一种情况是攻击者会做一个和原网站看起来一模一样的克隆网站（网址可能只有一个字符之差）。这种伎俩（包括在浏览器地址栏替换地址）的目的就是引诱用户到克隆并输入账号、密码或密钥。另一种情况是攻击者会发送一封伪装成来官方项目的邮件，也是为了引用户上钩，点击链接并输入个人信息。据Chainalysis，使用这种方法的骗子已经窃取了价值2.25亿美元的加密货币","目前，数字加密货币的防御机制逐步完善，用户自身素养也逐渐提升，黑客们对电子钱包的暴力攻击兴趣渐减。他们的注意力慢慢集中到了隐藏挖矿上。","据McAfee实验室，2018年第一季度全球共有290万个用于隐藏挖矿的病毒软件样本被登记在册。与2017年第四季度相比增长625%。这种方法被称为“加密劫持”，正因为这种方法够简单，黑客们放弃了传统的勒索计划，转而用此方法大规模部署“加密劫持”。","虽然黑客们对电子钱包的暴力攻击兴趣渐减，攻击活动并未减少。Carbon Black（该公司与网络安全公司有合作）专家透露，截止2018年7月，暗网上约有12000个交易平台，这些平台向黑客提供报价的大约有34000个。在这样一个平台上，售出的恶意攻击软件均价约为224美元。",{"img":"https://img.jinse.com/1015953_image3.png"},"图片来源：Carbon Black","这种病毒是怎么跑到我们的电脑上的？回到文章开头提到的新闻。7月27日，在Malwarebytes论坛上，用户开始在一个名为All-Radio 4.27 Portable程序专栏下发表评论，这个程序在用户不知情的情况下安装到了他们的设备中。由于无法将其删除，情况变得有些复杂。这个软件最开始算是一个无公害且比较流行的内容查看器，在被黑客修改后，变成了一个充满“惊喜”的潘多拉魔盒。","当然，All-Radio 4.27 Portable软件包还包含一个隐藏的“矿工”，不过这只会拖慢电脑运行速度。至于监测剪贴板的程序，当用户复制粘贴密码时，它就会替换地址，靠这种方法它已经收集了2343286个潜在受害者的比特币钱包信息。这是黑客第一次展示如此庞大的加密货币持有者数据库。","数据被替换后，用户就会乖乖地将资金转移到了攻击者的钱包地址。保护资金免受此影响的唯一办法就是访问网站时对输入的地址进行确认，虽然这会影响用户体验，不过是十分可靠的一种方式了，同时会让用户养成一种好的习惯。","在询问了All-Radio 4.27 Portable的受害者之后，发现恶意软件都是在用户做了不合理的操作之后进入了他们的电脑。","知名Mac恶意软件专家Patrick Wardle经常在他的博客中提到：很多针对普通用户的病毒都是很蠢的，就像被这种黑客攻击的那些人一样蠢。","因此，最后我们想给大家一个建议（来自Google的小型企业顾问Bryan Wallace）：“加密技术、杀毒软件和多因素认证只能在一定程度上保证你的资产安全；真正保护好资产的关键还是在于要有一定的预防措施和基本常识。”","来源：Cointelegraph"],"id":5},{"title":"33家钱包比较：一文读懂数字货币钱包","createTime":"2018/08/03 18:57","time":302,"content":["作者：Michael、Bobo",{"img":"https://img.jinse.com/1015121_watermarknone.png"},"导读","在传统世界里，钱包就是存储钱的地方。在数字货币世界里，钱包虽然也有类似的功能，但本质上不是“放钱”的地方，而是管理公钥和私钥的工具。","维京研究院汇总了33家数字货币钱包项目，并通过对其进行比较、分析得出：","从分类来看，数字货币钱包可以依据设备依赖性和去中心化程度两个维度归类，分别对应着脑钱包／纸钱包／网页端钱包／移动端钱包／PC端钱包／硬件钱包，及中心化钱包／轻钱包／全节点钱包。另外，依赖联网设备的钱包一般是热钱包，反之是冷钱包；仍然依托中介机构的是Off-Chain钱包，反之是On-Chain钱包。","从发展历史来看，数字货币钱包主要经历了两条主线：一是支持币种，从单资产钱包，到单链钱包，再到多链钱包；二是私钥管理方法，从非确定性钱包，到确定性钱包，再到分层确定性钱包。","从安全性来看，从钱包的生成到交易，都有被攻击的潜在问题。冷钱包的安全隐患主要是内生的，相反热钱包的安全隐患大部分是外生的，所以冷钱包的安全可控性更高。","从钱包项目来看，热钱包与冷钱包的创新方向迥然不同。热钱包创新目的在于流量的争夺，所以更倾向于融入社交、快速交易转账、理财等服务；冷钱包创新更多在于新颖的外形和安全技术的深耕。","以下为报告正文：",{"img":"https://img.jinse.com/1015130_watermarknone.png"},{"img":"https://img.jinse.com/1015131_watermarknone.png"},{"img":"https://img.jinse.com/1015132_watermarknone.png"},{"img":"https://img.jinse.com/1015133_watermarknone.png"},{"img":"https://img.jinse.com/1015134_watermarknone.png"},{"img":"https://img.jinse.com/1015135_watermarknone.png"},{"img":"https://img.jinse.com/1015136_watermarknone.png"},{"img":"https://img.jinse.com/1015137_watermarknone.png"},{"img":"https://img.jinse.com/1015138_watermarknone.png"},{"img":"https://img.jinse.com/1015139_watermarknone.png"},{"img":"https://img.jinse.com/1015140_watermarknone.png"},{"img":"https://img.jinse.com/1015141_watermarknone.png"},{"img":"https://img.jinse.com/1015142_watermarknone.png"},{"img":"https://img.jinse.com/1015143_watermarknone.png"},{"img":"https://img.jinse.com/1015144_watermarknone.png"},{"img":"https://img.jinse.com/1015145_watermarknone.png"},{"img":"https://img.jinse.com/1015146_watermarknone.png"},{"img":"https://img.jinse.com/1015147_watermarknone.png"},{"img":"https://img.jinse.com/1015148_watermarknone.png"},{"img":"https://img.jinse.com/1015149_watermarknone.png"},{"img":"https://img.jinse.com/1015150_watermarknone.png"}],"id":6}]}